Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_exti.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32U5Gx_exti.
; ===============

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32U5Gx_exti equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

#include	<stdint.h>

// EXTI address definitions
// ------------------------

typedef struct {
	volatile	uint32_t	RTSR1;
	volatile	uint32_t	FTSR1;
	volatile	uint32_t	SWIER1;
	volatile	uint32_t	RPR1;
	volatile	uint32_t	FPR1;
	volatile	uint32_t	SECCFGR1;
	volatile	uint32_t	PRIVCFGR1;
	volatile	uint32_t	RESERVED0[17];
	volatile	uint32_t	EXTICR1;
	volatile	uint32_t	EXTICR2;
	volatile	uint32_t	EXTICR3;
	volatile	uint32_t	EXTICR4;
	volatile	uint32_t	LOCKR;
	volatile	uint32_t	RESERVED1[3];
	volatile	uint32_t	IMR1;
	volatile	uint32_t	EMR1;
} EXTI_TypeDef;

#ifdef __cplusplus
#define	EXTI_NS	reinterpret_cast<EXTI_TypeDef *>(0x46022000u)
#define	EXTI_S	reinterpret_cast<EXTI_TypeDef *>(0x56022000u)

#else
#define	EXTI_NS	((EXTI_TypeDef *)0x46022000u)
#define	EXTI_S	((EXTI_TypeDef *)0x56022000u)
#endif

// RTSR1 Configuration

#define	EXTI_RTSR1_RT25				(0x1u<<25)
#define	EXTI_RTSR1_RT24				(0x1u<<24)
#define	EXTI_RTSR1_RT23				(0x1u<<23)
#define	EXTI_RTSR1_RT22				(0x1u<<22)
#define	EXTI_RTSR1_RT21				(0x1u<<21)
#define	EXTI_RTSR1_RT20				(0x1u<<20)
#define	EXTI_RTSR1_RT19				(0x1u<<19)
#define	EXTI_RTSR1_RT18				(0x1u<<18)
#define	EXTI_RTSR1_RT17				(0x1u<<17)
#define	EXTI_RTSR1_RT16				(0x1u<<16)
#define	EXTI_RTSR1_RT15				(0x1u<<15)
#define	EXTI_RTSR1_RT14				(0x1u<<14)
#define	EXTI_RTSR1_RT13				(0x1u<<13)
#define	EXTI_RTSR1_RT12				(0x1u<<12)
#define	EXTI_RTSR1_RT11				(0x1u<<11)
#define	EXTI_RTSR1_RT10				(0x1u<<10)
#define	EXTI_RTSR1_RT9				(0x1u<<9)
#define	EXTI_RTSR1_RT8				(0x1u<<8)
#define	EXTI_RTSR1_RT7				(0x1u<<7)
#define	EXTI_RTSR1_RT6				(0x1u<<6)
#define	EXTI_RTSR1_RT5				(0x1u<<5)
#define	EXTI_RTSR1_RT4				(0x1u<<4)
#define	EXTI_RTSR1_RT3				(0x1u<<3)
#define	EXTI_RTSR1_RT2				(0x1u<<2)
#define	EXTI_RTSR1_RT1				(0x1u<<1)
#define	EXTI_RTSR1_RT0				(0x1u<<0)
#define	EXTI_RTSR1_RT25_B_0X0		(0x0u<<25)
#define	EXTI_RTSR1_RT25_B_0X1		(0x1u<<25)
#define	EXTI_RTSR1_RT24_B_0X0		(0x0u<<24)
#define	EXTI_RTSR1_RT24_B_0X1		(0x1u<<24)
#define	EXTI_RTSR1_RT23_B_0X0		(0x0u<<23)
#define	EXTI_RTSR1_RT23_B_0X1		(0x1u<<23)
#define	EXTI_RTSR1_RT22_B_0X0		(0x0u<<22)
#define	EXTI_RTSR1_RT22_B_0X1		(0x1u<<22)
#define	EXTI_RTSR1_RT21_B_0X0		(0x0u<<21)
#define	EXTI_RTSR1_RT21_B_0X1		(0x1u<<21)
#define	EXTI_RTSR1_RT20_B_0X0		(0x0u<<20)
#define	EXTI_RTSR1_RT20_B_0X1		(0x1u<<20)
#define	EXTI_RTSR1_RT19_B_0X0		(0x0u<<19)
#define	EXTI_RTSR1_RT19_B_0X1		(0x1u<<19)
#define	EXTI_RTSR1_RT18_B_0X0		(0x0u<<18)
#define	EXTI_RTSR1_RT18_B_0X1		(0x1u<<18)
#define	EXTI_RTSR1_RT17_B_0X0		(0x0u<<17)
#define	EXTI_RTSR1_RT17_B_0X1		(0x1u<<17)
#define	EXTI_RTSR1_RT16_B_0X0		(0x0u<<16)
#define	EXTI_RTSR1_RT16_B_0X1		(0x1u<<16)
#define	EXTI_RTSR1_RT15_B_0X0		(0x0u<<15)
#define	EXTI_RTSR1_RT15_B_0X1		(0x1u<<15)
#define	EXTI_RTSR1_RT14_B_0X0		(0x0u<<14)
#define	EXTI_RTSR1_RT14_B_0X1		(0x1u<<14)
#define	EXTI_RTSR1_RT13_B_0X0		(0x0u<<13)
#define	EXTI_RTSR1_RT13_B_0X1		(0x1u<<13)
#define	EXTI_RTSR1_RT12_B_0X0		(0x0u<<12)
#define	EXTI_RTSR1_RT12_B_0X1		(0x1u<<12)
#define	EXTI_RTSR1_RT11_B_0X0		(0x0u<<11)
#define	EXTI_RTSR1_RT11_B_0X1		(0x1u<<11)
#define	EXTI_RTSR1_RT10_B_0X0		(0x0u<<10)
#define	EXTI_RTSR1_RT10_B_0X1		(0x1u<<10)
#define	EXTI_RTSR1_RT9_B_0X0		(0x0u<<9)
#define	EXTI_RTSR1_RT9_B_0X1		(0x1u<<9)
#define	EXTI_RTSR1_RT8_B_0X0		(0x0u<<8)
#define	EXTI_RTSR1_RT8_B_0X1		(0x1u<<8)
#define	EXTI_RTSR1_RT7_B_0X0		(0x0u<<7)
#define	EXTI_RTSR1_RT7_B_0X1		(0x1u<<7)
#define	EXTI_RTSR1_RT6_B_0X0		(0x0u<<6)
#define	EXTI_RTSR1_RT6_B_0X1		(0x1u<<6)
#define	EXTI_RTSR1_RT5_B_0X0		(0x0u<<5)
#define	EXTI_RTSR1_RT5_B_0X1		(0x1u<<5)
#define	EXTI_RTSR1_RT4_B_0X0		(0x0u<<4)
#define	EXTI_RTSR1_RT4_B_0X1		(0x1u<<4)
#define	EXTI_RTSR1_RT3_B_0X0		(0x0u<<3)
#define	EXTI_RTSR1_RT3_B_0X1		(0x1u<<3)
#define	EXTI_RTSR1_RT2_B_0X0		(0x0u<<2)
#define	EXTI_RTSR1_RT2_B_0X1		(0x1u<<2)
#define	EXTI_RTSR1_RT1_B_0X0		(0x0u<<1)
#define	EXTI_RTSR1_RT1_B_0X1		(0x1u<<1)
#define	EXTI_RTSR1_RT0_B_0X0		(0x0u<<0)
#define	EXTI_RTSR1_RT0_B_0X1		(0x1u<<0)

// FTSR1 Configuration

#define	EXTI_FTSR1_FT25				(0x1u<<25)
#define	EXTI_FTSR1_FT24				(0x1u<<24)
#define	EXTI_FTSR1_FT23				(0x1u<<23)
#define	EXTI_FTSR1_FT22				(0x1u<<22)
#define	EXTI_FTSR1_FT21				(0x1u<<21)
#define	EXTI_FTSR1_FT20				(0x1u<<20)
#define	EXTI_FTSR1_FT19				(0x1u<<19)
#define	EXTI_FTSR1_FT18				(0x1u<<18)
#define	EXTI_FTSR1_FT17				(0x1u<<17)
#define	EXTI_FTSR1_FT16				(0x1u<<16)
#define	EXTI_FTSR1_FT15				(0x1u<<15)
#define	EXTI_FTSR1_FT14				(0x1u<<14)
#define	EXTI_FTSR1_FT13				(0x1u<<13)
#define	EXTI_FTSR1_FT12				(0x1u<<12)
#define	EXTI_FTSR1_FT11				(0x1u<<11)
#define	EXTI_FTSR1_FT10				(0x1u<<10)
#define	EXTI_FTSR1_FT9				(0x1u<<9)
#define	EXTI_FTSR1_FT8				(0x1u<<8)
#define	EXTI_FTSR1_FT7				(0x1u<<7)
#define	EXTI_FTSR1_FT6				(0x1u<<6)
#define	EXTI_FTSR1_FT5				(0x1u<<5)
#define	EXTI_FTSR1_FT4				(0x1u<<4)
#define	EXTI_FTSR1_FT3				(0x1u<<3)
#define	EXTI_FTSR1_FT2				(0x1u<<2)
#define	EXTI_FTSR1_FT1				(0x1u<<1)
#define	EXTI_FTSR1_FT0				(0x1u<<0)
#define	EXTI_FTSR1_FT25_B_0X0		(0x0u<<25)
#define	EXTI_FTSR1_FT25_B_0X1		(0x1u<<25)
#define	EXTI_FTSR1_FT24_B_0X0		(0x0u<<24)
#define	EXTI_FTSR1_FT24_B_0X1		(0x1u<<24)
#define	EXTI_FTSR1_FT23_B_0X0		(0x0u<<23)
#define	EXTI_FTSR1_FT23_B_0X1		(0x1u<<23)
#define	EXTI_FTSR1_FT22_B_0X0		(0x0u<<22)
#define	EXTI_FTSR1_FT22_B_0X1		(0x1u<<22)
#define	EXTI_FTSR1_FT21_B_0X0		(0x0u<<21)
#define	EXTI_FTSR1_FT21_B_0X1		(0x1u<<21)
#define	EXTI_FTSR1_FT20_B_0X0		(0x0u<<20)
#define	EXTI_FTSR1_FT20_B_0X1		(0x1u<<20)
#define	EXTI_FTSR1_FT19_B_0X0		(0x0u<<19)
#define	EXTI_FTSR1_FT19_B_0X1		(0x1u<<19)
#define	EXTI_FTSR1_FT18_B_0X0		(0x0u<<18)
#define	EXTI_FTSR1_FT18_B_0X1		(0x1u<<18)
#define	EXTI_FTSR1_FT17_B_0X0		(0x0u<<17)
#define	EXTI_FTSR1_FT17_B_0X1		(0x1u<<17)
#define	EXTI_FTSR1_FT16_B_0X0		(0x0u<<16)
#define	EXTI_FTSR1_FT16_B_0X1		(0x1u<<16)
#define	EXTI_FTSR1_FT15_B_0X0		(0x0u<<15)
#define	EXTI_FTSR1_FT15_B_0X1		(0x1u<<15)
#define	EXTI_FTSR1_FT14_B_0X0		(0x0u<<14)
#define	EXTI_FTSR1_FT14_B_0X1		(0x1u<<14)
#define	EXTI_FTSR1_FT13_B_0X0		(0x0u<<13)
#define	EXTI_FTSR1_FT13_B_0X1		(0x1u<<13)
#define	EXTI_FTSR1_FT12_B_0X0		(0x0u<<12)
#define	EXTI_FTSR1_FT12_B_0X1		(0x1u<<12)
#define	EXTI_FTSR1_FT11_B_0X0		(0x0u<<11)
#define	EXTI_FTSR1_FT11_B_0X1		(0x1u<<11)
#define	EXTI_FTSR1_FT10_B_0X0		(0x0u<<10)
#define	EXTI_FTSR1_FT10_B_0X1		(0x1u<<10)
#define	EXTI_FTSR1_FT9_B_0X0		(0x0u<<9)
#define	EXTI_FTSR1_FT9_B_0X1		(0x1u<<9)
#define	EXTI_FTSR1_FT8_B_0X0		(0x0u<<8)
#define	EXTI_FTSR1_FT8_B_0X1		(0x1u<<8)
#define	EXTI_FTSR1_FT7_B_0X0		(0x0u<<7)
#define	EXTI_FTSR1_FT7_B_0X1		(0x1u<<7)
#define	EXTI_FTSR1_FT6_B_0X0		(0x0u<<6)
#define	EXTI_FTSR1_FT6_B_0X1		(0x1u<<6)
#define	EXTI_FTSR1_FT5_B_0X0		(0x0u<<5)
#define	EXTI_FTSR1_FT5_B_0X1		(0x1u<<5)
#define	EXTI_FTSR1_FT4_B_0X0		(0x0u<<4)
#define	EXTI_FTSR1_FT4_B_0X1		(0x1u<<4)
#define	EXTI_FTSR1_FT3_B_0X0		(0x0u<<3)
#define	EXTI_FTSR1_FT3_B_0X1		(0x1u<<3)
#define	EXTI_FTSR1_FT2_B_0X0		(0x0u<<2)
#define	EXTI_FTSR1_FT2_B_0X1		(0x1u<<2)
#define	EXTI_FTSR1_FT1_B_0X0		(0x0u<<1)
#define	EXTI_FTSR1_FT1_B_0X1		(0x1u<<1)
#define	EXTI_FTSR1_FT0_B_0X0		(0x0u<<0)
#define	EXTI_FTSR1_FT0_B_0X1		(0x1u<<0)

