Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_exti.h
// SWIER1 Configuration

#define	EXTI_SWIER1_SWI25			(0x1u<<25)
#define	EXTI_SWIER1_SWI24			(0x1u<<24)
#define	EXTI_SWIER1_SWI23			(0x1u<<23)
#define	EXTI_SWIER1_SWI22			(0x1u<<22)
#define	EXTI_SWIER1_SWI21			(0x1u<<21)
#define	EXTI_SWIER1_SWI20			(0x1u<<20)
#define	EXTI_SWIER1_SWI19			(0x1u<<19)
#define	EXTI_SWIER1_SWI18			(0x1u<<18)
#define	EXTI_SWIER1_SWI17			(0x1u<<17)
#define	EXTI_SWIER1_SWI16			(0x1u<<16)
#define	EXTI_SWIER1_SWI15			(0x1u<<15)
#define	EXTI_SWIER1_SWI14			(0x1u<<14)
#define	EXTI_SWIER1_SWI13			(0x1u<<13)
#define	EXTI_SWIER1_SWI12			(0x1u<<12)
#define	EXTI_SWIER1_SWI11			(0x1u<<11)
#define	EXTI_SWIER1_SWI10			(0x1u<<10)
#define	EXTI_SWIER1_SWI9			(0x1u<<9)
#define	EXTI_SWIER1_SWI8			(0x1u<<8)
#define	EXTI_SWIER1_SWI7			(0x1u<<7)
#define	EXTI_SWIER1_SWI6			(0x1u<<6)
#define	EXTI_SWIER1_SWI5			(0x1u<<5)
#define	EXTI_SWIER1_SWI4			(0x1u<<4)
#define	EXTI_SWIER1_SWI3			(0x1u<<3)
#define	EXTI_SWIER1_SWI2			(0x1u<<2)
#define	EXTI_SWIER1_SWI1			(0x1u<<1)
#define	EXTI_SWIER1_SWI0			(0x1u<<0)
#define	EXTI_SWIER1_SWI25_B_0X0		(0x0u<<25)
#define	EXTI_SWIER1_SWI25_B_0X1		(0x1u<<25)
#define	EXTI_SWIER1_SWI24_B_0X0		(0x0u<<24)
#define	EXTI_SWIER1_SWI24_B_0X1		(0x1u<<24)
#define	EXTI_SWIER1_SWI23_B_0X0		(0x0u<<23)
#define	EXTI_SWIER1_SWI23_B_0X1		(0x1u<<23)
#define	EXTI_SWIER1_SWI22_B_0X0		(0x0u<<22)
#define	EXTI_SWIER1_SWI22_B_0X1		(0x1u<<22)
#define	EXTI_SWIER1_SWI21_B_0X0		(0x0u<<21)
#define	EXTI_SWIER1_SWI21_B_0X1		(0x1u<<21)
#define	EXTI_SWIER1_SWI20_B_0X0		(0x0u<<20)
#define	EXTI_SWIER1_SWI20_B_0X1		(0x1u<<20)
#define	EXTI_SWIER1_SWI19_B_0X0		(0x0u<<19)
#define	EXTI_SWIER1_SWI19_B_0X1		(0x1u<<19)
#define	EXTI_SWIER1_SWI18_B_0X0		(0x0u<<18)
#define	EXTI_SWIER1_SWI18_B_0X1		(0x1u<<18)
#define	EXTI_SWIER1_SWI17_B_0X0		(0x0u<<17)
#define	EXTI_SWIER1_SWI17_B_0X1		(0x1u<<17)
#define	EXTI_SWIER1_SWI16_B_0X0		(0x0u<<16)
#define	EXTI_SWIER1_SWI16_B_0X1		(0x1u<<16)
#define	EXTI_SWIER1_SWI15_B_0X0		(0x0u<<15)
#define	EXTI_SWIER1_SWI15_B_0X1		(0x1u<<15)
#define	EXTI_SWIER1_SWI14_B_0X0		(0x0u<<14)
#define	EXTI_SWIER1_SWI14_B_0X1		(0x1u<<14)
#define	EXTI_SWIER1_SWI13_B_0X0		(0x0u<<13)
#define	EXTI_SWIER1_SWI13_B_0X1		(0x1u<<13)
#define	EXTI_SWIER1_SWI12_B_0X0		(0x0u<<12)
#define	EXTI_SWIER1_SWI12_B_0X1		(0x1u<<12)
#define	EXTI_SWIER1_SWI11_B_0X0		(0x0u<<11)
#define	EXTI_SWIER1_SWI11_B_0X1		(0x1u<<11)
#define	EXTI_SWIER1_SWI10_B_0X0		(0x0u<<10)
#define	EXTI_SWIER1_SWI10_B_0X1		(0x1u<<10)
#define	EXTI_SWIER1_SWI9_B_0X0		(0x0u<<9)
#define	EXTI_SWIER1_SWI9_B_0X1		(0x1u<<9)
#define	EXTI_SWIER1_SWI8_B_0X0		(0x0u<<8)
#define	EXTI_SWIER1_SWI8_B_0X1		(0x1u<<8)
#define	EXTI_SWIER1_SWI7_B_0X0		(0x0u<<7)
#define	EXTI_SWIER1_SWI7_B_0X1		(0x1u<<7)
#define	EXTI_SWIER1_SWI6_B_0X0		(0x0u<<6)
#define	EXTI_SWIER1_SWI6_B_0X1		(0x1u<<6)
#define	EXTI_SWIER1_SWI5_B_0X0		(0x0u<<5)
#define	EXTI_SWIER1_SWI5_B_0X1		(0x1u<<5)
#define	EXTI_SWIER1_SWI4_B_0X0		(0x0u<<4)
#define	EXTI_SWIER1_SWI4_B_0X1		(0x1u<<4)
#define	EXTI_SWIER1_SWI3_B_0X0		(0x0u<<3)
#define	EXTI_SWIER1_SWI3_B_0X1		(0x1u<<3)
#define	EXTI_SWIER1_SWI2_B_0X0		(0x0u<<2)
#define	EXTI_SWIER1_SWI2_B_0X1		(0x1u<<2)
#define	EXTI_SWIER1_SWI1_B_0X0		(0x0u<<1)
#define	EXTI_SWIER1_SWI1_B_0X1		(0x1u<<1)
#define	EXTI_SWIER1_SWI0_B_0X0		(0x0u<<0)
#define	EXTI_SWIER1_SWI0_B_0X1		(0x1u<<0)

// RPR1 Configuration

#define	EXTI_RPR1_RPIF25			(0x1u<<25)
#define	EXTI_RPR1_RPIF24			(0x1u<<24)
#define	EXTI_RPR1_RPIF23			(0x1u<<23)
#define	EXTI_RPR1_RPIF22			(0x1u<<22)
#define	EXTI_RPR1_RPIF21			(0x1u<<21)
#define	EXTI_RPR1_RPIF20			(0x1u<<20)
#define	EXTI_RPR1_RPIF19			(0x1u<<19)
#define	EXTI_RPR1_RPIF18			(0x1u<<18)
#define	EXTI_RPR1_RPIF17			(0x1u<<17)
#define	EXTI_RPR1_RPIF16			(0x1u<<16)
#define	EXTI_RPR1_RPIF15			(0x1u<<15)
#define	EXTI_RPR1_RPIF14			(0x1u<<14)
#define	EXTI_RPR1_RPIF13			(0x1u<<13)
#define	EXTI_RPR1_RPIF12			(0x1u<<12)
#define	EXTI_RPR1_RPIF11			(0x1u<<11)
#define	EXTI_RPR1_RPIF10			(0x1u<<10)
#define	EXTI_RPR1_RPIF9				(0x1u<<9)
#define	EXTI_RPR1_RPIF8				(0x1u<<8)
#define	EXTI_RPR1_RPIF7				(0x1u<<7)
#define	EXTI_RPR1_RPIF6				(0x1u<<6)
#define	EXTI_RPR1_RPIF5				(0x1u<<5)
#define	EXTI_RPR1_RPIF4				(0x1u<<4)
#define	EXTI_RPR1_RPIF3				(0x1u<<3)
#define	EXTI_RPR1_RPIF2				(0x1u<<2)
#define	EXTI_RPR1_RPIF1				(0x1u<<1)
#define	EXTI_RPR1_RPIF0				(0x1u<<0)
#define	EXTI_RPR1_RPIF25_B_0X0		(0x0u<<25)
#define	EXTI_RPR1_RPIF25_B_0X1		(0x1u<<25)
#define	EXTI_RPR1_RPIF24_B_0X0		(0x0u<<24)
#define	EXTI_RPR1_RPIF24_B_0X1		(0x1u<<24)
#define	EXTI_RPR1_RPIF23_B_0X0		(0x0u<<23)
#define	EXTI_RPR1_RPIF23_B_0X1		(0x1u<<23)
#define	EXTI_RPR1_RPIF22_B_0X0		(0x0u<<22)
#define	EXTI_RPR1_RPIF22_B_0X1		(0x1u<<22)
#define	EXTI_RPR1_RPIF21_B_0X0		(0x0u<<21)
#define	EXTI_RPR1_RPIF21_B_0X1		(0x1u<<21)
#define	EXTI_RPR1_RPIF20_B_0X0		(0x0u<<20)
#define	EXTI_RPR1_RPIF20_B_0X1		(0x1u<<20)
#define	EXTI_RPR1_RPIF19_B_0X0		(0x0u<<19)
#define	EXTI_RPR1_RPIF19_B_0X1		(0x1u<<19)
#define	EXTI_RPR1_RPIF18_B_0X0		(0x0u<<18)
#define	EXTI_RPR1_RPIF18_B_0X1		(0x1u<<18)
#define	EXTI_RPR1_RPIF17_B_0X0		(0x0u<<17)
#define	EXTI_RPR1_RPIF17_B_0X1		(0x1u<<17)
#define	EXTI_RPR1_RPIF16_B_0X0		(0x0u<<16)
#define	EXTI_RPR1_RPIF16_B_0X1		(0x1u<<16)
#define	EXTI_RPR1_RPIF15_B_0X0		(0x0u<<15)
#define	EXTI_RPR1_RPIF15_B_0X1		(0x1u<<15)
#define	EXTI_RPR1_RPIF14_B_0X0		(0x0u<<14)
#define	EXTI_RPR1_RPIF14_B_0X1		(0x1u<<14)
#define	EXTI_RPR1_RPIF13_B_0X0		(0x0u<<13)
#define	EXTI_RPR1_RPIF13_B_0X1		(0x1u<<13)
#define	EXTI_RPR1_RPIF12_B_0X0		(0x0u<<12)
#define	EXTI_RPR1_RPIF12_B_0X1		(0x1u<<12)
#define	EXTI_RPR1_RPIF11_B_0X0		(0x0u<<11)
#define	EXTI_RPR1_RPIF11_B_0X1		(0x1u<<11)
#define	EXTI_RPR1_RPIF10_B_0X0		(0x0u<<10)
#define	EXTI_RPR1_RPIF10_B_0X1		(0x1u<<10)
#define	EXTI_RPR1_RPIF9_B_0X0		(0x0u<<9)
#define	EXTI_RPR1_RPIF9_B_0X1		(0x1u<<9)
#define	EXTI_RPR1_RPIF8_B_0X0		(0x0u<<8)
#define	EXTI_RPR1_RPIF8_B_0X1		(0x1u<<8)
#define	EXTI_RPR1_RPIF7_B_0X0		(0x0u<<7)
#define	EXTI_RPR1_RPIF7_B_0X1		(0x1u<<7)
#define	EXTI_RPR1_RPIF6_B_0X0		(0x0u<<6)
#define	EXTI_RPR1_RPIF6_B_0X1		(0x1u<<6)
#define	EXTI_RPR1_RPIF5_B_0X0		(0x0u<<5)
#define	EXTI_RPR1_RPIF5_B_0X1		(0x1u<<5)
#define	EXTI_RPR1_RPIF4_B_0X0		(0x0u<<4)
#define	EXTI_RPR1_RPIF4_B_0X1		(0x1u<<4)
#define	EXTI_RPR1_RPIF3_B_0X0		(0x0u<<3)
#define	EXTI_RPR1_RPIF3_B_0X1		(0x1u<<3)
#define	EXTI_RPR1_RPIF2_B_0X0		(0x0u<<2)
#define	EXTI_RPR1_RPIF2_B_0X1		(0x1u<<2)
#define	EXTI_RPR1_RPIF1_B_0X0		(0x0u<<1)
#define	EXTI_RPR1_RPIF1_B_0X1		(0x1u<<1)
#define	EXTI_RPR1_RPIF0_B_0X0		(0x0u<<0)
#define	EXTI_RPR1_RPIF0_B_0X1		(0x1u<<0)

// FPR1 Configuration

#define	EXTI_FPR1_FPIF25			(0x1u<<25)
#define	EXTI_FPR1_FPIF24			(0x1u<<24)
#define	EXTI_FPR1_FPIF23			(0x1u<<23)
#define	EXTI_FPR1_FPIF22			(0x1u<<22)
#define	EXTI_FPR1_FPIF21			(0x1u<<21)
#define	EXTI_FPR1_FPIF20			(0x1u<<20)
#define	EXTI_FPR1_FPIF19			(0x1u<<19)
#define	EXTI_FPR1_FPIF18			(0x1u<<18)
#define	EXTI_FPR1_FPIF17			(0x1u<<17)
#define	EXTI_FPR1_FPIF16			(0x1u<<16)
#define	EXTI_FPR1_FPIF15			(0x1u<<15)
#define	EXTI_FPR1_FPIF14			(0x1u<<14)
#define	EXTI_FPR1_FPIF13			(0x1u<<13)
#define	EXTI_FPR1_FPIF12			(0x1u<<12)
#define	EXTI_FPR1_FPIF11			(0x1u<<11)
#define	EXTI_FPR1_FPIF10			(0x1u<<10)
#define	EXTI_FPR1_FPIF9				(0x1u<<9)
#define	EXTI_FPR1_FPIF8				(0x1u<<8)
#define	EXTI_FPR1_FPIF7				(0x1u<<7)
#define	EXTI_FPR1_FPIF6				(0x1u<<6)
#define	EXTI_FPR1_FPIF5				(0x1u<<5)
#define	EXTI_FPR1_FPIF4				(0x1u<<4)
#define	EXTI_FPR1_FPIF3				(0x1u<<3)
#define	EXTI_FPR1_FPIF2				(0x1u<<2)
#define	EXTI_FPR1_FPIF1				(0x1u<<1)
#define	EXTI_FPR1_FPIF0				(0x1u<<0)
#define	EXTI_FPR1_FPIF25_B_0X0		(0x0u<<25)
#define	EXTI_FPR1_FPIF25_B_0X1		(0x1u<<25)
#define	EXTI_FPR1_FPIF24_B_0X0		(0x0u<<24)
#define	EXTI_FPR1_FPIF24_B_0X1		(0x1u<<24)
#define	EXTI_FPR1_FPIF23_B_0X0		(0x0u<<23)
#define	EXTI_FPR1_FPIF23_B_0X1		(0x1u<<23)
#define	EXTI_FPR1_FPIF22_B_0X0		(0x0u<<22)
#define	EXTI_FPR1_FPIF22_B_0X1		(0x1u<<22)
#define	EXTI_FPR1_FPIF21_B_0X0		(0x0u<<21)
#define	EXTI_FPR1_FPIF21_B_0X1		(0x1u<<21)
#define	EXTI_FPR1_FPIF20_B_0X0		(0x0u<<20)
#define	EXTI_FPR1_FPIF20_B_0X1		(0x1u<<20)
#define	EXTI_FPR1_FPIF19_B_0X0		(0x0u<<19)
#define	EXTI_FPR1_FPIF19_B_0X1		(0x1u<<19)
#define	EXTI_FPR1_FPIF18_B_0X0		(0x0u<<18)
#define	EXTI_FPR1_FPIF18_B_0X1		(0x1u<<18)
#define	EXTI_FPR1_FPIF17_B_0X0		(0x0u<<17)
#define	EXTI_FPR1_FPIF17_B_0X1		(0x1u<<17)
#define	EXTI_FPR1_FPIF16_B_0X0		(0x0u<<16)
#define	EXTI_FPR1_FPIF16_B_0X1		(0x1u<<16)
#define	EXTI_FPR1_FPIF15_B_0X0		(0x0u<<15)
#define	EXTI_FPR1_FPIF15_B_0X1		(0x1u<<15)
#define	EXTI_FPR1_FPIF14_B_0X0		(0x0u<<14)
#define	EXTI_FPR1_FPIF14_B_0X1		(0x1u<<14)
#define	EXTI_FPR1_FPIF13_B_0X0		(0x0u<<13)
#define	EXTI_FPR1_FPIF13_B_0X1		(0x1u<<13)
#define	EXTI_FPR1_FPIF12_B_0X0		(0x0u<<12)
#define	EXTI_FPR1_FPIF12_B_0X1		(0x1u<<12)
#define	EXTI_FPR1_FPIF11_B_0X0		(0x0u<<11)
#define	EXTI_FPR1_FPIF11_B_0X1		(0x1u<<11)
#define	EXTI_FPR1_FPIF10_B_0X0		(0x0u<<10)
#define	EXTI_FPR1_FPIF10_B_0X1		(0x1u<<10)
#define	EXTI_FPR1_FPIF9_B_0X0		(0x0u<<9)
#define	EXTI_FPR1_FPIF9_B_0X1		(0x1u<<9)
#define	EXTI_FPR1_FPIF8_B_0X0		(0x0u<<8)
#define	EXTI_FPR1_FPIF8_B_0X1		(0x1u<<8)
#define	EXTI_FPR1_FPIF7_B_0X0		(0x0u<<7)
#define	EXTI_FPR1_FPIF7_B_0X1		(0x1u<<7)
#define	EXTI_FPR1_FPIF6_B_0X0		(0x0u<<6)
#define	EXTI_FPR1_FPIF6_B_0X1		(0x1u<<6)
#define	EXTI_FPR1_FPIF5_B_0X0		(0x0u<<5)
#define	EXTI_FPR1_FPIF5_B_0X1		(0x1u<<5)
#define	EXTI_FPR1_FPIF4_B_0X0		(0x0u<<4)
#define	EXTI_FPR1_FPIF4_B_0X1		(0x1u<<4)
#define	EXTI_FPR1_FPIF3_B_0X0		(0x0u<<3)
#define	EXTI_FPR1_FPIF3_B_0X1		(0x1u<<3)
#define	EXTI_FPR1_FPIF2_B_0X0		(0x0u<<2)
#define	EXTI_FPR1_FPIF2_B_0X1		(0x1u<<2)
#define	EXTI_FPR1_FPIF1_B_0X0		(0x0u<<1)
#define	EXTI_FPR1_FPIF1_B_0X1		(0x1u<<1)
#define	EXTI_FPR1_FPIF0_B_0X0		(0x0u<<0)
#define	EXTI_FPR1_FPIF0_B_0X1		(0x1u<<0)

