Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_exti.h
// SECCFGR1 Configuration

#define	EXTI_SECCFGR1_SEC25			(0x1u<<25)
#define	EXTI_SECCFGR1_SEC24			(0x1u<<24)
#define	EXTI_SECCFGR1_SEC23			(0x1u<<23)
#define	EXTI_SECCFGR1_SEC22			(0x1u<<22)
#define	EXTI_SECCFGR1_SEC21			(0x1u<<21)
#define	EXTI_SECCFGR1_SEC20			(0x1u<<20)
#define	EXTI_SECCFGR1_SEC19			(0x1u<<19)
#define	EXTI_SECCFGR1_SEC18			(0x1u<<18)
#define	EXTI_SECCFGR1_SEC17			(0x1u<<17)
#define	EXTI_SECCFGR1_SEC16			(0x1u<<16)
#define	EXTI_SECCFGR1_SEC15			(0x1u<<15)
#define	EXTI_SECCFGR1_SEC14			(0x1u<<14)
#define	EXTI_SECCFGR1_SEC13			(0x1u<<13)
#define	EXTI_SECCFGR1_SEC12			(0x1u<<12)
#define	EXTI_SECCFGR1_SEC11			(0x1u<<11)
#define	EXTI_SECCFGR1_SEC10			(0x1u<<10)
#define	EXTI_SECCFGR1_SEC9			(0x1u<<9)
#define	EXTI_SECCFGR1_SEC8			(0x1u<<8)
#define	EXTI_SECCFGR1_SEC7			(0x1u<<7)
#define	EXTI_SECCFGR1_SEC6			(0x1u<<6)
#define	EXTI_SECCFGR1_SEC5			(0x1u<<5)
#define	EXTI_SECCFGR1_SEC4			(0x1u<<4)
#define	EXTI_SECCFGR1_SEC3			(0x1u<<3)
#define	EXTI_SECCFGR1_SEC2			(0x1u<<2)
#define	EXTI_SECCFGR1_SEC1			(0x1u<<1)
#define	EXTI_SECCFGR1_SEC0			(0x1u<<0)
#define	EXTI_SECCFGR1_SEC25_B_0X0	(0x0u<<25)
#define	EXTI_SECCFGR1_SEC25_B_0X1	(0x1u<<25)
#define	EXTI_SECCFGR1_SEC24_B_0X0	(0x0u<<24)
#define	EXTI_SECCFGR1_SEC24_B_0X1	(0x1u<<24)
#define	EXTI_SECCFGR1_SEC23_B_0X0	(0x0u<<23)
#define	EXTI_SECCFGR1_SEC23_B_0X1	(0x1u<<23)
#define	EXTI_SECCFGR1_SEC22_B_0X0	(0x0u<<22)
#define	EXTI_SECCFGR1_SEC22_B_0X1	(0x1u<<22)
#define	EXTI_SECCFGR1_SEC21_B_0X0	(0x0u<<21)
#define	EXTI_SECCFGR1_SEC21_B_0X1	(0x1u<<21)
#define	EXTI_SECCFGR1_SEC20_B_0X0	(0x0u<<20)
#define	EXTI_SECCFGR1_SEC20_B_0X1	(0x1u<<20)
#define	EXTI_SECCFGR1_SEC19_B_0X0	(0x0u<<19)
#define	EXTI_SECCFGR1_SEC19_B_0X1	(0x1u<<19)
#define	EXTI_SECCFGR1_SEC18_B_0X0	(0x0u<<18)
#define	EXTI_SECCFGR1_SEC18_B_0X1	(0x1u<<18)
#define	EXTI_SECCFGR1_SEC17_B_0X0	(0x0u<<17)
#define	EXTI_SECCFGR1_SEC17_B_0X1	(0x1u<<17)
#define	EXTI_SECCFGR1_SEC16_B_0X0	(0x0u<<16)
#define	EXTI_SECCFGR1_SEC16_B_0X1	(0x1u<<16)
#define	EXTI_SECCFGR1_SEC15_B_0X0	(0x0u<<15)
#define	EXTI_SECCFGR1_SEC15_B_0X1	(0x1u<<15)
#define	EXTI_SECCFGR1_SEC14_B_0X0	(0x0u<<14)
#define	EXTI_SECCFGR1_SEC14_B_0X1	(0x1u<<14)
#define	EXTI_SECCFGR1_SEC13_B_0X0	(0x0u<<13)
#define	EXTI_SECCFGR1_SEC13_B_0X1	(0x1u<<13)
#define	EXTI_SECCFGR1_SEC12_B_0X0	(0x0u<<12)
#define	EXTI_SECCFGR1_SEC12_B_0X1	(0x1u<<12)
#define	EXTI_SECCFGR1_SEC11_B_0X0	(0x0u<<11)
#define	EXTI_SECCFGR1_SEC11_B_0X1	(0x1u<<11)
#define	EXTI_SECCFGR1_SEC10_B_0X0	(0x0u<<10)
#define	EXTI_SECCFGR1_SEC10_B_0X1	(0x1u<<10)
#define	EXTI_SECCFGR1_SEC9_B_0X0	(0x0u<<9)
#define	EXTI_SECCFGR1_SEC9_B_0X1	(0x1u<<9)
#define	EXTI_SECCFGR1_SEC8_B_0X0	(0x0u<<8)
#define	EXTI_SECCFGR1_SEC8_B_0X1	(0x1u<<8)
#define	EXTI_SECCFGR1_SEC7_B_0X0	(0x0u<<7)
#define	EXTI_SECCFGR1_SEC7_B_0X1	(0x1u<<7)
#define	EXTI_SECCFGR1_SEC6_B_0X0	(0x0u<<6)
#define	EXTI_SECCFGR1_SEC6_B_0X1	(0x1u<<6)
#define	EXTI_SECCFGR1_SEC5_B_0X0	(0x0u<<5)
#define	EXTI_SECCFGR1_SEC5_B_0X1	(0x1u<<5)
#define	EXTI_SECCFGR1_SEC4_B_0X0	(0x0u<<4)
#define	EXTI_SECCFGR1_SEC4_B_0X1	(0x1u<<4)
#define	EXTI_SECCFGR1_SEC3_B_0X0	(0x0u<<3)
#define	EXTI_SECCFGR1_SEC3_B_0X1	(0x1u<<3)
#define	EXTI_SECCFGR1_SEC2_B_0X0	(0x0u<<2)
#define	EXTI_SECCFGR1_SEC2_B_0X1	(0x1u<<2)
#define	EXTI_SECCFGR1_SEC1_B_0X0	(0x0u<<1)
#define	EXTI_SECCFGR1_SEC1_B_0X1	(0x1u<<1)
#define	EXTI_SECCFGR1_SEC0_B_0X0	(0x0u<<0)
#define	EXTI_SECCFGR1_SEC0_B_0X1	(0x1u<<0)

// PRIVCFGR1 Configuration

#define	EXTI_PRIVCFGR1_PRIV25		(0x1u<<25)
#define	EXTI_PRIVCFGR1_PRIV24		(0x1u<<24)
#define	EXTI_PRIVCFGR1_PRIV23		(0x1u<<23)
#define	EXTI_PRIVCFGR1_PRIV22		(0x1u<<22)
#define	EXTI_PRIVCFGR1_PRIV21		(0x1u<<21)
#define	EXTI_PRIVCFGR1_PRIV20		(0x1u<<20)
#define	EXTI_PRIVCFGR1_PRIV19		(0x1u<<19)
#define	EXTI_PRIVCFGR1_PRIV18		(0x1u<<18)
#define	EXTI_PRIVCFGR1_PRIV17		(0x1u<<17)
#define	EXTI_PRIVCFGR1_PRIV16		(0x1u<<16)
#define	EXTI_PRIVCFGR1_PRIV15		(0x1u<<15)
#define	EXTI_PRIVCFGR1_PRIV14		(0x1u<<14)
#define	EXTI_PRIVCFGR1_PRIV13		(0x1u<<13)
#define	EXTI_PRIVCFGR1_PRIV12		(0x1u<<12)
#define	EXTI_PRIVCFGR1_PRIV11		(0x1u<<11)
#define	EXTI_PRIVCFGR1_PRIV10		(0x1u<<10)
#define	EXTI_PRIVCFGR1_PRIV9		(0x1u<<9)
#define	EXTI_PRIVCFGR1_PRIV8		(0x1u<<8)
#define	EXTI_PRIVCFGR1_PRIV7		(0x1u<<7)
#define	EXTI_PRIVCFGR1_PRIV6		(0x1u<<6)
#define	EXTI_PRIVCFGR1_PRIV5		(0x1u<<5)
#define	EXTI_PRIVCFGR1_PRIV4		(0x1u<<4)
#define	EXTI_PRIVCFGR1_PRIV3		(0x1u<<3)
#define	EXTI_PRIVCFGR1_PRIV2		(0x1u<<2)
#define	EXTI_PRIVCFGR1_PRIV1		(0x1u<<1)
#define	EXTI_PRIVCFGR1_PRIV0		(0x1u<<0)
#define	EXTI_PRIVCFGR1_PRIV25_B_0X0	(0x0u<<25)
#define	EXTI_PRIVCFGR1_PRIV25_B_0X1	(0x1u<<25)
#define	EXTI_PRIVCFGR1_PRIV24_B_0X0	(0x0u<<24)
#define	EXTI_PRIVCFGR1_PRIV24_B_0X1	(0x1u<<24)
#define	EXTI_PRIVCFGR1_PRIV23_B_0X0	(0x0u<<23)
#define	EXTI_PRIVCFGR1_PRIV23_B_0X1	(0x1u<<23)
#define	EXTI_PRIVCFGR1_PRIV22_B_0X0	(0x0u<<22)
#define	EXTI_PRIVCFGR1_PRIV22_B_0X1	(0x1u<<22)
#define	EXTI_PRIVCFGR1_PRIV21_B_0X0	(0x0u<<21)
#define	EXTI_PRIVCFGR1_PRIV21_B_0X1	(0x1u<<21)
#define	EXTI_PRIVCFGR1_PRIV20_B_0X0	(0x0u<<20)
#define	EXTI_PRIVCFGR1_PRIV20_B_0X1	(0x1u<<20)
#define	EXTI_PRIVCFGR1_PRIV19_B_0X0	(0x0u<<19)
#define	EXTI_PRIVCFGR1_PRIV19_B_0X1	(0x1u<<19)
#define	EXTI_PRIVCFGR1_PRIV18_B_0X0	(0x0u<<18)
#define	EXTI_PRIVCFGR1_PRIV18_B_0X1	(0x1u<<18)
#define	EXTI_PRIVCFGR1_PRIV17_B_0X0	(0x0u<<17)
#define	EXTI_PRIVCFGR1_PRIV17_B_0X1	(0x1u<<17)
#define	EXTI_PRIVCFGR1_PRIV16_B_0X0	(0x0u<<16)
#define	EXTI_PRIVCFGR1_PRIV16_B_0X1	(0x1u<<16)
#define	EXTI_PRIVCFGR1_PRIV15_B_0X0	(0x0u<<15)
#define	EXTI_PRIVCFGR1_PRIV15_B_0X1	(0x1u<<15)
#define	EXTI_PRIVCFGR1_PRIV14_B_0X0	(0x0u<<14)
#define	EXTI_PRIVCFGR1_PRIV14_B_0X1	(0x1u<<14)
#define	EXTI_PRIVCFGR1_PRIV13_B_0X0	(0x0u<<13)
#define	EXTI_PRIVCFGR1_PRIV13_B_0X1	(0x1u<<13)
#define	EXTI_PRIVCFGR1_PRIV12_B_0X0	(0x0u<<12)
#define	EXTI_PRIVCFGR1_PRIV12_B_0X1	(0x1u<<12)
#define	EXTI_PRIVCFGR1_PRIV11_B_0X0	(0x0u<<11)
#define	EXTI_PRIVCFGR1_PRIV11_B_0X1	(0x1u<<11)
#define	EXTI_PRIVCFGR1_PRIV10_B_0X0	(0x0u<<10)
#define	EXTI_PRIVCFGR1_PRIV10_B_0X1	(0x1u<<10)
#define	EXTI_PRIVCFGR1_PRIV9_B_0X0	(0x0u<<9)
#define	EXTI_PRIVCFGR1_PRIV9_B_0X1	(0x1u<<9)
#define	EXTI_PRIVCFGR1_PRIV8_B_0X0	(0x0u<<8)
#define	EXTI_PRIVCFGR1_PRIV8_B_0X1	(0x1u<<8)
#define	EXTI_PRIVCFGR1_PRIV7_B_0X0	(0x0u<<7)
#define	EXTI_PRIVCFGR1_PRIV7_B_0X1	(0x1u<<7)
#define	EXTI_PRIVCFGR1_PRIV6_B_0X0	(0x0u<<6)
#define	EXTI_PRIVCFGR1_PRIV6_B_0X1	(0x1u<<6)
#define	EXTI_PRIVCFGR1_PRIV5_B_0X0	(0x0u<<5)
#define	EXTI_PRIVCFGR1_PRIV5_B_0X1	(0x1u<<5)
#define	EXTI_PRIVCFGR1_PRIV4_B_0X0	(0x0u<<4)
#define	EXTI_PRIVCFGR1_PRIV4_B_0X1	(0x1u<<4)
#define	EXTI_PRIVCFGR1_PRIV3_B_0X0	(0x0u<<3)
#define	EXTI_PRIVCFGR1_PRIV3_B_0X1	(0x1u<<3)
#define	EXTI_PRIVCFGR1_PRIV2_B_0X0	(0x0u<<2)
#define	EXTI_PRIVCFGR1_PRIV2_B_0X1	(0x1u<<2)
#define	EXTI_PRIVCFGR1_PRIV1_B_0X0	(0x0u<<1)
#define	EXTI_PRIVCFGR1_PRIV1_B_0X1	(0x1u<<1)
#define	EXTI_PRIVCFGR1_PRIV0_B_0X0	(0x0u<<0)
#define	EXTI_PRIVCFGR1_PRIV0_B_0X1	(0x1u<<0)

// EXTICR1 Configuration

