Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_exti.h
#define	EXTI_EXTICR1_EXTI3			(0xFFu<<24)
#define	EXTI_EXTICR1_EXTI3_0		(0x1u<<24)
#define	EXTI_EXTICR1_EXTI2			(0xFFu<<16)
#define	EXTI_EXTICR1_EXTI2_0		(0x1u<<16)
#define	EXTI_EXTICR1_EXTI1			(0xFFu<<8)
#define	EXTI_EXTICR1_EXTI1_0		(0x1u<<8)
#define	EXTI_EXTICR1_EXTI0			(0xFFu<<0)
#define	EXTI_EXTICR1_EXTI0_0		(0x1u<<0)

// EXTICR2 Configuration

#define	EXTI_EXTICR2_EXTI7			(0xFFu<<24)
#define	EXTI_EXTICR2_EXTI7_0		(0x1u<<24)
#define	EXTI_EXTICR2_EXTI6			(0xFFu<<16)
#define	EXTI_EXTICR2_EXTI6_0		(0x1u<<16)
#define	EXTI_EXTICR2_EXTI5			(0xFFu<<8)
#define	EXTI_EXTICR2_EXTI5_0		(0x1u<<8)
#define	EXTI_EXTICR2_EXTI4			(0xFFu<<0)
#define	EXTI_EXTICR2_EXTI4_0		(0x1u<<0)

// EXTICR3 Configuration

#define	EXTI_EXTICR3_EXTI11			(0xFFu<<24)
#define	EXTI_EXTICR3_EXTI11_0		(0x1u<<24)
#define	EXTI_EXTICR3_EXTI10			(0xFFu<<16)
#define	EXTI_EXTICR3_EXTI10_0		(0x1u<<16)
#define	EXTI_EXTICR3_EXTI9			(0xFFu<<8)
#define	EXTI_EXTICR3_EXTI9_0		(0x1u<<8)
#define	EXTI_EXTICR3_EXTI8			(0xFFu<<0)
#define	EXTI_EXTICR3_EXTI8_0		(0x1u<<0)

// EXTICR4 Configuration

#define	EXTI_EXTICR4_EXTI15			(0xFFu<<24)
#define	EXTI_EXTICR4_EXTI15_0		(0x1u<<24)
#define	EXTI_EXTICR4_EXTI14			(0xFFu<<16)
#define	EXTI_EXTICR4_EXTI14_0		(0x1u<<16)
#define	EXTI_EXTICR4_EXTI13			(0xFFu<<8)
#define	EXTI_EXTICR4_EXTI13_0		(0x1u<<8)
#define	EXTI_EXTICR4_EXTI12			(0xFFu<<0)
#define	EXTI_EXTICR4_EXTI12_0		(0x1u<<0)

// LOCKR Configuration

#define	EXTI_LOCKR_LOCK				(0x1u<<0)
#define	EXTI_LOCKR_LOCK_B_0X0		(0x0u<<0)
#define	EXTI_LOCKR_LOCK_B_0X1		(0x1u<<0)

// IMR1 Configuration

#define	EXTI_IMR1_IM25				(0x1u<<25)
#define	EXTI_IMR1_IM24				(0x1u<<24)
#define	EXTI_IMR1_IM23				(0x1u<<23)
#define	EXTI_IMR1_IM22				(0x1u<<22)
#define	EXTI_IMR1_IM21				(0x1u<<21)
#define	EXTI_IMR1_IM20				(0x1u<<20)
#define	EXTI_IMR1_IM19				(0x1u<<19)
#define	EXTI_IMR1_IM18				(0x1u<<18)
#define	EXTI_IMR1_IM17				(0x1u<<17)
#define	EXTI_IMR1_IM16				(0x1u<<16)
#define	EXTI_IMR1_IM15				(0x1u<<15)
#define	EXTI_IMR1_IM14				(0x1u<<14)
#define	EXTI_IMR1_IM13				(0x1u<<13)
#define	EXTI_IMR1_IM12				(0x1u<<12)
#define	EXTI_IMR1_IM11				(0x1u<<11)
#define	EXTI_IMR1_IM10				(0x1u<<10)
#define	EXTI_IMR1_IM9				(0x1u<<9)
#define	EXTI_IMR1_IM8				(0x1u<<8)
#define	EXTI_IMR1_IM7				(0x1u<<7)
#define	EXTI_IMR1_IM6				(0x1u<<6)
#define	EXTI_IMR1_IM5				(0x1u<<5)
#define	EXTI_IMR1_IM4				(0x1u<<4)
#define	EXTI_IMR1_IM3				(0x1u<<3)
#define	EXTI_IMR1_IM2				(0x1u<<2)
#define	EXTI_IMR1_IM1				(0x1u<<1)
#define	EXTI_IMR1_IM0				(0x1u<<0)
#define	EXTI_IMR1_IM25_B_0X0		(0x0u<<25)
#define	EXTI_IMR1_IM25_B_0X1		(0x1u<<25)
#define	EXTI_IMR1_IM24_B_0X0		(0x0u<<24)
#define	EXTI_IMR1_IM24_B_0X1		(0x1u<<24)
#define	EXTI_IMR1_IM23_B_0X0		(0x0u<<23)
#define	EXTI_IMR1_IM23_B_0X1		(0x1u<<23)
#define	EXTI_IMR1_IM22_B_0X0		(0x0u<<22)
#define	EXTI_IMR1_IM22_B_0X1		(0x1u<<22)
#define	EXTI_IMR1_IM21_B_0X0		(0x0u<<21)
#define	EXTI_IMR1_IM21_B_0X1		(0x1u<<21)
#define	EXTI_IMR1_IM20_B_0X0		(0x0u<<20)
#define	EXTI_IMR1_IM20_B_0X1		(0x1u<<20)
#define	EXTI_IMR1_IM19_B_0X0		(0x0u<<19)
#define	EXTI_IMR1_IM19_B_0X1		(0x1u<<19)
#define	EXTI_IMR1_IM18_B_0X0		(0x0u<<18)
#define	EXTI_IMR1_IM18_B_0X1		(0x1u<<18)
#define	EXTI_IMR1_IM17_B_0X0		(0x0u<<17)
#define	EXTI_IMR1_IM17_B_0X1		(0x1u<<17)
#define	EXTI_IMR1_IM16_B_0X0		(0x0u<<16)
#define	EXTI_IMR1_IM16_B_0X1		(0x1u<<16)
#define	EXTI_IMR1_IM15_B_0X0		(0x0u<<15)
#define	EXTI_IMR1_IM15_B_0X1		(0x1u<<15)
#define	EXTI_IMR1_IM14_B_0X0		(0x0u<<14)
#define	EXTI_IMR1_IM14_B_0X1		(0x1u<<14)
#define	EXTI_IMR1_IM13_B_0X0		(0x0u<<13)
#define	EXTI_IMR1_IM13_B_0X1		(0x1u<<13)
#define	EXTI_IMR1_IM12_B_0X0		(0x0u<<12)
#define	EXTI_IMR1_IM12_B_0X1		(0x1u<<12)
#define	EXTI_IMR1_IM11_B_0X0		(0x0u<<11)
#define	EXTI_IMR1_IM11_B_0X1		(0x1u<<11)
#define	EXTI_IMR1_IM10_B_0X0		(0x0u<<10)
#define	EXTI_IMR1_IM10_B_0X1		(0x1u<<10)
#define	EXTI_IMR1_IM9_B_0X0			(0x0u<<9)
#define	EXTI_IMR1_IM9_B_0X1			(0x1u<<9)
#define	EXTI_IMR1_IM8_B_0X0			(0x0u<<8)
#define	EXTI_IMR1_IM8_B_0X1			(0x1u<<8)
#define	EXTI_IMR1_IM7_B_0X0			(0x0u<<7)
#define	EXTI_IMR1_IM7_B_0X1			(0x1u<<7)
#define	EXTI_IMR1_IM6_B_0X0			(0x0u<<6)
#define	EXTI_IMR1_IM6_B_0X1			(0x1u<<6)
#define	EXTI_IMR1_IM5_B_0X0			(0x0u<<5)
#define	EXTI_IMR1_IM5_B_0X1			(0x1u<<5)
#define	EXTI_IMR1_IM4_B_0X0			(0x0u<<4)
#define	EXTI_IMR1_IM4_B_0X1			(0x1u<<4)
#define	EXTI_IMR1_IM3_B_0X0			(0x0u<<3)
#define	EXTI_IMR1_IM3_B_0X1			(0x1u<<3)
#define	EXTI_IMR1_IM2_B_0X0			(0x0u<<2)
#define	EXTI_IMR1_IM2_B_0X1			(0x1u<<2)
#define	EXTI_IMR1_IM1_B_0X0			(0x0u<<1)
#define	EXTI_IMR1_IM1_B_0X1			(0x1u<<1)
#define	EXTI_IMR1_IM0_B_0X0			(0x0u<<0)
#define	EXTI_IMR1_IM0_B_0X1			(0x1u<<0)

// EMR1 Configuration

#define	EXTI_EMR1_EM25				(0x1u<<25)
#define	EXTI_EMR1_EM24				(0x1u<<24)
#define	EXTI_EMR1_EM23				(0x1u<<23)
#define	EXTI_EMR1_EM22				(0x1u<<22)
#define	EXTI_EMR1_EM21				(0x1u<<21)
#define	EXTI_EMR1_EM20				(0x1u<<20)
#define	EXTI_EMR1_EM19				(0x1u<<19)
#define	EXTI_EMR1_EM18				(0x1u<<18)
#define	EXTI_EMR1_EM17				(0x1u<<17)
#define	EXTI_EMR1_EM16				(0x1u<<16)
#define	EXTI_EMR1_EM15				(0x1u<<15)
#define	EXTI_EMR1_EM14				(0x1u<<14)
#define	EXTI_EMR1_EM13				(0x1u<<13)
#define	EXTI_EMR1_EM12				(0x1u<<12)
#define	EXTI_EMR1_EM11				(0x1u<<11)
#define	EXTI_EMR1_EM10				(0x1u<<10)
#define	EXTI_EMR1_EM9				(0x1u<<9)
#define	EXTI_EMR1_EM8				(0x1u<<8)
#define	EXTI_EMR1_EM7				(0x1u<<7)
#define	EXTI_EMR1_EM6				(0x1u<<6)
#define	EXTI_EMR1_EM5				(0x1u<<5)
#define	EXTI_EMR1_EM4				(0x1u<<4)
#define	EXTI_EMR1_EM3				(0x1u<<3)
#define	EXTI_EMR1_EM2				(0x1u<<2)
#define	EXTI_EMR1_EM1				(0x1u<<1)
#define	EXTI_EMR1_EM0				(0x1u<<0)
#define	EXTI_EMR1_EM25_B_0X0		(0x0u<<25)
#define	EXTI_EMR1_EM25_B_0X1		(0x1u<<25)
#define	EXTI_EMR1_EM24_B_0X0		(0x0u<<24)
#define	EXTI_EMR1_EM24_B_0X1		(0x1u<<24)
#define	EXTI_EMR1_EM23_B_0X0		(0x0u<<23)
#define	EXTI_EMR1_EM23_B_0X1		(0x1u<<23)
#define	EXTI_EMR1_EM22_B_0X0		(0x0u<<22)
#define	EXTI_EMR1_EM22_B_0X1		(0x1u<<22)
#define	EXTI_EMR1_EM21_B_0X0		(0x0u<<21)
#define	EXTI_EMR1_EM21_B_0X1		(0x1u<<21)
#define	EXTI_EMR1_EM20_B_0X0		(0x0u<<20)
#define	EXTI_EMR1_EM20_B_0X1		(0x1u<<20)
#define	EXTI_EMR1_EM19_B_0X0		(0x0u<<19)
#define	EXTI_EMR1_EM19_B_0X1		(0x1u<<19)
#define	EXTI_EMR1_EM18_B_0X0		(0x0u<<18)
#define	EXTI_EMR1_EM18_B_0X1		(0x1u<<18)
#define	EXTI_EMR1_EM17_B_0X0		(0x0u<<17)
#define	EXTI_EMR1_EM17_B_0X1		(0x1u<<17)
#define	EXTI_EMR1_EM16_B_0X0		(0x0u<<16)
#define	EXTI_EMR1_EM16_B_0X1		(0x1u<<16)
#define	EXTI_EMR1_EM15_B_0X0		(0x0u<<15)
#define	EXTI_EMR1_EM15_B_0X1		(0x1u<<15)
#define	EXTI_EMR1_EM14_B_0X0		(0x0u<<14)
#define	EXTI_EMR1_EM14_B_0X1		(0x1u<<14)
#define	EXTI_EMR1_EM13_B_0X0		(0x0u<<13)
#define	EXTI_EMR1_EM13_B_0X1		(0x1u<<13)
#define	EXTI_EMR1_EM12_B_0X0		(0x0u<<12)
#define	EXTI_EMR1_EM12_B_0X1		(0x1u<<12)
#define	EXTI_EMR1_EM11_B_0X0		(0x0u<<11)
#define	EXTI_EMR1_EM11_B_0X1		(0x1u<<11)
#define	EXTI_EMR1_EM10_B_0X0		(0x0u<<10)
#define	EXTI_EMR1_EM10_B_0X1		(0x1u<<10)
#define	EXTI_EMR1_EM9_B_0X0			(0x0u<<9)
#define	EXTI_EMR1_EM9_B_0X1			(0x1u<<9)
#define	EXTI_EMR1_EM8_B_0X0			(0x0u<<8)
#define	EXTI_EMR1_EM8_B_0X1			(0x1u<<8)
#define	EXTI_EMR1_EM7_B_0X0			(0x0u<<7)
#define	EXTI_EMR1_EM7_B_0X1			(0x1u<<7)
#define	EXTI_EMR1_EM6_B_0X0			(0x0u<<6)
#define	EXTI_EMR1_EM6_B_0X1			(0x1u<<6)
#define	EXTI_EMR1_EM5_B_0X0			(0x0u<<5)
#define	EXTI_EMR1_EM5_B_0X1			(0x1u<<5)
#define	EXTI_EMR1_EM4_B_0X0			(0x0u<<4)
#define	EXTI_EMR1_EM4_B_0X1			(0x1u<<4)
#define	EXTI_EMR1_EM3_B_0X0			(0x0u<<3)
#define	EXTI_EMR1_EM3_B_0X1			(0x1u<<3)
#define	EXTI_EMR1_EM2_B_0X0			(0x0u<<2)
#define	EXTI_EMR1_EM2_B_0X1			(0x1u<<2)
#define	EXTI_EMR1_EM1_B_0X0			(0x0u<<1)
#define	EXTI_EMR1_EM1_B_0X1			(0x1u<<1)
#define	EXTI_EMR1_EM0_B_0X0			(0x0u<<0)
#define	EXTI_EMR1_EM0_B_0X1			(0x1u<<0)
